export const apiErrorsTypes: any = {
  'user-exist': 'هذا الحساب قد تم استعماله من قبل، يرجى محاولة تسجيل الدخول به',
  'user-not-found': 'لم يتم العثور على هذا الحساب، الرجاء التتأكد ومحاولة مره اخرى',
  'token-not-found': 'صلاحية لاعادة كلمة المرور قد اكتملت، يرجى اعادة الخطوات مرة اخرى',
  'invalid-token': 'صلاحية لاعادة كلمة المرور قد اكتملت، يرجى اعادة الخطوات مرة اخرى',
  'user-subscription-canceled': 'تم تعطيل الحساب، اذا حدث اي خطأ يرجى مراجعة الشركة بهذه المشكلة',
  'invalid-credentials': 'يوجد خطا في رمز المرور او البريد الاكتروني، الرجاء التتاكد ومحاولة مره ثانية',
  'user-role-invalid': 'نوعية هذه الحساب لا تسمحه بالدخول الى هذا النطاق'
}